import { Street } from "../types";

export const streets = ["n", "e", "s", "w"] as const;

export const jungle길이 = 7;

type X = number;
type Y = number;

export const 고정칸_좌표: [Y, X][] = [
  [0, 0],
  [0, 2],
  [0, 4],
  [0, 6],

  [2, 0],
  [2, 2],
  [2, 4],
  [2, 6],

  [4, 0],
  [4, 2],
  [4, 4],
  [4, 6],

  [6, 0],
  [6, 2],
  [6, 4],
  [6, 6],
];

export const 고정칸Street: { [key in string]: Street[] } = {
  "0,0": ["e", "s"],
  "0,2": ["w", "e", "s"],
  "0,4": ["w", "e", "s"],
  "0,6": ["w", "s"],

  "2,0": ["n", "e", "s"],
  "2,2": ["n", "e", "s"],
  "2,4": ["w", "e", "s"],
  "2,6": ["w", "n", "s"],

  "4,0": ["n", "e", "s"],
  "4,2": ["e", "w", "s"],
  "4,4": ["n", "w", "s"],
  "4,6": ["w", "n", "s"],

  "6,0": ["n", "e"],
  "6,2": ["n", "e", "w"],
  "6,4": ["n", "e", "w"],
  "6,6": ["n", "w"],
};

export const 밀_수_있는_칸: [Y, X][] = [
  [0, 1],
  [0, 3],
  [0, 5],

  [1, 0],
  [1, 6],

  [3, 0],
  [3, 6],

  [5, 0],
  [5, 6],

  [6, 1],
  [6, 3],
  [6, 5],
];

export const 유동칸_중_3갈래_개수 = 3;
